---
kind: type
id: T:Autodesk.Revit.DB.Architecture.FasciaType
source: html/ed44fcab-1425-b04f-d4eb-16d948f00375.htm
---
# Autodesk.Revit.DB.Architecture.FasciaType

An object that represents the fascia type
in Autodesk Revit.

## Syntax (C#)
```csharp
public class FasciaType : HostedSweepType
```